ban.spellright
bierner.markdown-mermaid
codezombiech.gitignore
DavidAnson.vscode-markdownlint
DavidSchuldenfrei.gtest-adapter
dbaeumer.vscode-eslint
druideinformatique.antidote
eamodio.gitlens
ecmel.vscode-html-css
evilz.vscode-reveal
formulahendry.code-runner
fortran-lang.linter-gfortran
geeklearningio.graphviz-markdown-preview
george-alisson.html-preview-vscode
GitHub.copilot
GitHub.copilot-chat
hiro-sun.vscode-emacs
James-Yu.latex-workshop
janisdd.vscode-edit-csv
joaompinto.vscode-graphviz
jock.svg
josetr.cmake-language-support-vscode
julialang.language-julia
MatthewEvers.compiler-explorer
mechatroner.rainbow-csv
mgt19937.typst-preview
mhutchie.git-graph
mitaki28.vscode-clang
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-fr
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.autopep8
ms-python.flake8
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
nvarner.typst-lsp
RandomFractalsInc.geo-data-viewer
redhat.java
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
shardulm94.trailing-spaces
shengchen.vscode-checkstyle
sjhuangx.vscode-scheme
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-french
twxs.cmake
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
vscode-org-mode.org-mode
wayou.vscode-todo-highlight
withfig.fig
yzhang.markdown-all-in-one
